In [1]:
#importing libraries
import pandas as pd
import numpy as np

In [2]:
# 1. Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe.

ser=pd.DataFrame(np.random.randint(0,1000,size=365),
                  columns=["Random"],
                  index=pd.date_range("20190101", periods=365))
ser

            Random
2019-01-01     281
2019-01-02     998
2019-01-03     850
2019-01-04       9
2019-01-05     366
...            ...
2019-12-27     134
2019-12-28     956
2019-12-29     872
2019-12-30     519
2019-12-31      26

[365 rows x 1 columns]

In [3]:
# 2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names.
data=[[23,71],
      [42,32],
      [55,48]]
df=pd.DataFrame(data, columns=['Height', 'Weight'])
df

   Height  Weight
0      23      71
1      42      32
2      55      48

In [4]:
# 3. How to get the items of series A not present in series B .From ser1 remove items present in ser2.
ser1=pd.Series([2,3,4,5])
ser2=pd.Series([5,6,7,8])
print(ser1)
print(ser2)
res=ser1[~ser1.isin(ser2)]
print(res)

0    2
1    3
2    4
3    5
dtype: int64
0    5
1    6
2    7
3    8
dtype: int64
0    2
1    3
2    4
dtype: int64

 # Questions on Titanic Dataset :-

In [5]:
#Reading the titanic dataset
df = pd.read_csv(r'C:\Users\kalya\Datasets\Titanic\titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# 4. Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
# 5. How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset
df['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [8]:
# 6. Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset
print("Top 2 frequencies")
df.Embarked.value_counts()

Top 2 frequencies

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [9]:
df['Embarked'].replace('Q','Other')

0          S
1          C
2          S
3          S
4          S
       ...
886        S
887        S
888        S
889        C
890    Other
Name: Embarked, Length: 891, dtype: object

In [10]:
# 7.  Bin the price column in titanic data set into 5 equal groups and get counts of each bin
min(df.Fare)

0.0

In [11]:
max(df.Fare)

512.3292

In [12]:
df['Fare_bin']=pd.cut(df['Fare'],bins=[0,115,215,315,415,515], labels=['low','medium','high','expensive','highly_expensive'])
df['Fare_bin'].value_counts()

low                 834
medium               26
high                 13
highly_expensive      3
expensive             0
Name: Fare_bin, dtype: int64

In [13]:
# 8. Count the number of missing values in each column
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Fare_bin        15
dtype: int64

In [14]:
# 9. Get the row number of the 5th largest value in the Age column of titanic dataset?
print('5th largest value is','\t')
df.Age.nlargest(5).idxmax()

5th largest value is

630

In [15]:
# 10 . Normalize all columns in a dataframe?
# I believe by default all the columns in pandas dataframes are normalized. I think we cannot do anything
#in this case for this question. Kindly advise if i overlloekd/ missing anything here.

In [16]:
# 11. Get the indices of items of ser2 in ser1 as a list.
ser1=pd.Series([10,9,6,5,3,1,12,8,13])
ser2=pd.Series([1,3,10,13])
output=ser1[ser1.isin(ser2)].index
print(output)

Int64Index([0, 4, 5, 8], dtype='int64')

In [17]:
# 12. How to convert a series of date-strings to a timeseries?

ser=pd.Series(['01Jan2010','02-02-2011','20120303','2013/04/04','2014-05-05',
                        '2015-06-06T12:20'])
ser_time=pd.to_datetime(ser)
print(ser_time)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [18]:
# 13. Get the day of month, week number, day of year and day of week from ser.
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
from dateutil.parser import parse
ser_ts = ser.map(lambda x: parse(x))

In [19]:
# Extracting 'day of the month' seperately
print("Date: ", ser_ts.dt.day.tolist())

Date:  [1, 2, 3, 4, 5, 6]

In [20]:
# Extracting 'week number' seperately
print("Week number: ", ser_ts.dt.weekofyear.tolist())

Week number:  [53, 5, 9, 14, 19, 23]

In [21]:
#  Extrcting day of year
print("Day number of year: ", ser_ts.dt.dayofyear.tolist())

Day number of year:  [1, 33, 63, 94, 125, 157]

In [24]:
# Extracting day of week
print("Day of week: ", ser_ts.dt.dayofweek.tolist())

Day of week:  [4, 2, 5, 3, 0, 5]

In [25]:
# 14. Compute the euclidean distance between series (points) p and q, without using a packaged formula.

p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
print("Euclidean distance between series points is :",sum((p - q)**2)**.5)

Euclidean distance between series points is : 18.16590212458495

In [30]:
# 15. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)
#saturdays
ser = pd.Series(pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

0   2000-01-01
1   2000-01-08
2   2000-01-15
3   2000-01-22
4   2000-01-29
5   2000-02-05
6   2000-02-12
7   2000-02-19
8   2000-02-26
9   2000-03-04
dtype: datetime64[ns]

In [31]:
#sundays

ser1 = pd.Series(pd.date_range('2000-01-01', periods=10, freq='W-SUN'))
ser1

0   2000-01-02
1   2000-01-09
2   2000-01-16
3   2000-01-23
4   2000-01-30
5   2000-02-06
6   2000-02-13
7   2000-02-20
8   2000-02-27
9   2000-03-05
dtype: datetime64[ns]

In [37]:
# 16. Import every 50th row of BostonHousing dataset as a dataframe.
Bostondf=pd.read_csv(r'C:\Users\kalya\Datasets\Boston_housingprices\boston_house_price.csv')
Bostondf.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [38]:
df_50=Bostondf[lambda x: x.index%50==0]
df_50

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
50,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45,19.7
100,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42,27.5
150,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10,21.5
200,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45,32.9
250,0.14030,22.0,5.86,0.0,0.431,6.487,13.0,7.3967,7.0,330.0,19.1,396.28,5.90,24.4
300,0.04417,70.0,2.24,0.0,0.400,6.871,47.4,7.8278,5.0,358.0,14.8,390.86,6.07,24.8
350,0.06211,40.0,1.25,0.0,0.429,6.490,44.4,8.7921,1.0,335.0,19.7,396.90,5.98,22.9
400,25.04610,0.0,18.10,0.0,0.693,5.987,100.0,1.5888,24.0,666.0,20.2,396.90,26.77,5.6
450,6.71772,0.0,18.10,0.0,0.713,6.749,92.6,2.3236,24.0,666.0,20.2,0.32,17.44,13.4
500,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33,16.8

 #                             The End